"Share on Facebook" = "Compartir en Facebook";
"Share on Twitter" = "Compartir en Twitter";
"Share on Email" = "Acciones en el correo electrónico";
"Cancel" = "cancelar";
"Close" = "cerca";
"All" = "todos";
"Submit" = "presentar";